import pandas as pd

def create_hanzi_structure_dataframe():
    """
    创建并返回汉字结构方式的 DataFrame。
    """
    hanzi_structure_data = [
        {"结构方式": "独体结构", "例字": "米、不", "间架比例": "方正", "代码": "D0"},
        {"结构方式": "镶嵌结构", "例字": "爽", "间架比例": "方正", "代码": "D1"},
        {"结构方式": "品字形结构", "例字": "晶、众", "间架比例": "各部分相同", "代码": "A0"},
        {"结构方式": "上下结构", "例字": "", "间架比例": "上下结构", "代码": "B0"},
        {"结构方式": "上下结构", "例字": "录、华", "间架比例": "上下相等", "代码": "B1"},
        {"结构方式": "上下结构", "例字": "它、花", "间架比例": "上小下大", "代码": "B2"},
        {"结构方式": "上下结构", "例字": "基、想", "间架比例": "上大下小", "代码": "B3"},
        {"结构方式": "田字结构", "例字": "叕、茻", "间架比例": "四部分相同", "代码": "B4"},
        {"结构方式": "上中下结构", "例字": "", "间架比例": "上中下结构", "代码": "E0"},
        {"结构方式": "上中下结构", "例字": "意、翼", "间架比例": "上中下相等", "代码": "E1"},
        {"结构方式": "上中下结构", "例字": "量、裹", "间架比例": "上中下不等", "代码": "E2"},
        {"结构方式": "左右结构", "例字": "", "间架比例": "左右结构", "代码": "H0"},
        {"结构方式": "左右结构", "例字": "羽、联", "间架比例": "左右相等", "代码": "H1"},
        {"结构方式": "左右结构", "例字": "伟、搞", "间架比例": "左窄右宽", "代码": "H2"},
        {"结构方式": "左右结构", "例字": "刚、郭", "间架比例": "左宽右窄", "代码": "H3"},
        {"结构方式": "左中右结构", "例字": "", "间架比例": "左中右结构", "代码": "M0"},
        {"结构方式": "左中右结构", "例字": "街、掰", "间架比例": "左中右相等", "代码": "M1"},
        {"结构方式": "左中右结构", "例字": "辩、傲", "间架比例": "左中右不等", "代码": "M2"},
        {"结构方式": "全包围结构", "例字": "圆、国", "间架比例": "全包围", "代码": "Q0"},
        {"结构方式": "半包围结构", "例字": "", "间架比例": "半包围结构", "代码": "R0"},
        {"结构方式": "半包围结构", "例字": "匠、区", "间架比例": "左包右", "代码": "R1"},
        {"结构方式": "半包围结构", "例字": "历、尾", "间架比例": "左上包右下", "代码": "R2"},
        {"结构方式": "半包围结构", "例字": "勾、句", "间架比例": "右上包左下", "代码": "R3"},
        {"结构方式": "半包围结构", "例字": "遍、廷", "间架比例": "左下包右上", "代码": "R4"},
        {"结构方式": "半包围结构", "例字": "冈、闲", "间架比例": "上包下", "代码": "R5"},
        {"结构方式": "半包围结构", "例字": "函、凶", "间架比例": "下包上", "代码": "R6"},
    ]
    return pd.DataFrame(hanzi_structure_data)
